Revit 2026 API

# ValueAtPointBase Class

---

A base class representing storage of values at a given point.

SystemObject Autodesk.Revit.DBValueAtPointBase Autodesk.Revit.DB.AnalysisValueAtPoint Autodesk.Revit.DB.AnalysisVectorAtPoint

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ValueAtPointBase : IDisposable
```
```vb
Public Class ValueAtPointBase
	Implements IDisposable
```
```cpp
public ref class ValueAtPointBase : IDisposable
```
```fsharp
type ValueAtPointBase =
    class
        interface IDisposable
    end
```

The ValueAtPointBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | ClearAllFlags | Sets flags for all measurements to ValueAtPointFlags::None. |
|  | ClearFlagsAt | Sets flags for the given measurement to ValueAtPointFlags::None. |
|  | Dispose | Releases all resources used by the ValueAtPointBase |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFlags | Returns flags for the given measurement. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetFlags(IListInt32) |  |
|  | SetFlags(Int32) | Sets the flags associated to all measurements to the same value. |
|  | SetFlags(Int32, Int32) | Sets the flags associated to a given measurement. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

This class stores a set of measurements and corresponding mapped flags. The flags are defined in the enumerated type ValueAtPointFlags.

#### Reference

Autodesk.Revit.DB Namespace